// Напишите программу, которая на вход принимает чило
// и выдает ее квадрат (число умноженное само на себя)
int n;
 
n = Convert.ToInt32(Console.ReadLine());
Console.WriteLine (n*n);

